In [1]:
import numpy as np
import pandas as  pd

from datetime import datetime

In [2]:
year = 2025
month = 1
day = 1
hour = 2
min = 30
sec = 15

In [3]:
date = datetime(year, month, day, hour, min, sec)

In [4]:
date

datetime.datetime(2025, 1, 1, 2, 30, 15)

In [5]:
date.year

2025

In [6]:
date.hour

2

In [7]:
series = pd.Series(['Nov 3 1990', '2000-01-01' ],None)

In [8]:
series

0    Nov 3 1990
1    2000-01-01
dtype: object

In [10]:
pd.to_datetime(series, format='mixed')

0   1990-11-03
1   2000-01-01
dtype: datetime64[ns]